Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/legal_matters_and_health/index.html.txt.tmx
Source language: en
Languages: ga

source: Legal matters and health
ga: Cúrsaí dlí agus sláinte

source: Access to medical records
ga: Rochtain ar thaifid leighis

source: There are various ways in which you may access personal medical records. Find out about the procedures and rules
ga: Tá cur síos sa cháipéis seo ar na bealaí éagsúla inár féidir le duine teacht ar Thaifid Leighis

source: An Advance Healthcare Directive in Ireland is a statement about the type and extent of medical or surgical treatment you want in the future, on the assumption that you will not be able to make that decision at the relevant time
ga: Is ráiteas é réamhthreoir cúraim maidir leis an gcineál agus an méid cóireála leighis nó máinliachta a bheidh ag teastáil uait sa todhchaí, de bhun na toimhdean nach mbeidh sé de chumas agat an cinneadh sin a dhéanamh ag an am ábhartha

source: Consent to medical and surgical procedures
ga: Toiliú don chóireáil leighis agus máinliach

source: As a general rule, informed consent must be given before medical and surgical procedures can happen in Ireland. Find out more
ga: Tá cur síos sa cháipéis seo ar na rialacha a bhaineann le toiliú don chóireáil leighis agus máinliach

source: Legal arrangements for incapacity
ga: Socruithe Dlíthiúla maidir le hÉagumas

source: Legal arrangements for people who are unable to look after their own affairs
ga: Na socruithe dlíthiúla éagsúla is féidir le duine a dhéanamh chun aire a thabhairt dá g(h)nóthaí mura bhfuil sé/sí in ann déanamh amhlaidh ar chúis ar bith

source: Explanation of what a Ward of Court in Ireland is and how to apply to have someone made a Ward of Court
ga: Tá cur síos sa cháipéis seo ar Choimircí Cúirte agus cén chaoi a ndéantar iarratas le duine a ainmniú ina c(h)oimirce cúirte

source: Most Read in "Health"
ga: Ábhar is mó éilimh i "Sláinte"

source: Admission to a psychiatric hospital
ga: Ospidéal síciatrach a iontráil

source: Medical card means test: aged under 70
ga: Tástáil mhaoine cárta leighis: daoine faoi bhun 70 bliain d’aois
